<?php

return array(
    'name' => 'Тип',
    
    'header.title' => 'Тип объекта',
    'header.description' => 'создание и редактирование',

    'list.name' => 'Типы объектов',
    'list.names' => 'Типы объектов',
    'list.create' => 'Создание типа',
    'list.edit' => 'Редактирование типа',
    'list.btn.edit' => 'Редактирование типа',
    'list.btn.delete' => 'Удаление типа',

    'error.namespace.search' => 'Не существует namespace, который содержит часть ":path"',
    'error.table.create' => 'Невозможно создать таблицу ":table"',
    'error.file.create' => 'Невозможно создать файл в директории ":dir"',
    'error.class_controller.define' => 'Класс не определен или не выбрана папка размещения файла класса формы',
    'error.code_empty' => 'Пожалуйста, прежде укажите значение в поле "Код типа"',
    'error.class_form_exists' => 'Класс формы уже существует. Выберите другое место расположение файла',
    'error.class_model_exists' => 'Класс модели уже существует. Выберите другое место расположение файла',

    'error' => array(
        'code.regex' => 'Поле "Код типа" должно начинаться с латинской буквы и содержать латинские символы, цифры или символ подчеркивания'
    ),
);
